# NewFamilySymbolProfile Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewFamilySymbolProfile Method
Application Class See Also
---
Creates a new FamilySymbolProfile object.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilySymbolProfile NewFamilySymbolProfile(
	FamilySymbol familySymbol
)
```

Visual Basic
---
```text
Public Function NewFamilySymbolProfile ( _
	familySymbol As FamilySymbol _
) As FamilySymbolProfile
```

Visual C++
---
```text
public:
FamilySymbolProfile^ NewFamilySymbolProfile(
	FamilySymbol^ familySymbol
)
```

# ### Parameters
familySymbol
    Type: Autodesk.Revit.DB..::..FamilySymbolThe family symbol of the Profile.
# ### Return Value
The new FamilySymbolProfile object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the argument familySymbol is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
Application Class
Autodesk.Revit.Creation Namespace